import org.junit.After;
import org.junit.Before;
import org.junit.Test;

import java.io.ByteArrayInputStream;
import java.io.ByteArrayOutputStream;
import java.io.PrintStream;

import static org.junit.Assert.*;

public class BasicPathTest {



    @Before
    public void setUp() throws Exception {

    }

    @After
    public void tearDown() throws Exception {
        System.setOut(null);
        System.setIn(null);
    }

    @Test
    public void test01() {
        String data = "20173442\n" +
                "12345\n"+
                "123456\n"+
                "6";
        ByteArrayOutputStream outContent = new ByteArrayOutputStream();
        ByteArrayInputStream input = new ByteArrayInputStream(data.getBytes());
        System.setOut(new PrintStream(outContent));
        System.setIn(input);
        String[] a= {"1"};
        new Atm().main(a);
        assertEquals("**************************************************************************\r\n" +
                "                  欢迎使用中国工商银行自动柜员系统                                               \r\n" +
                "**************************************************************************\r\n" +
                "                      请输入您的账号\r\n" +
                "**************************************************************************\r\n" +
                "             欢迎20173442使用中国工商银行自助柜员系统                                \r\n" +
                "**************************************************************************\r\n" +
                "                           请输入密码\r\n" +
                "                         请重新输入密码\r\n" +
                "密码正确\r\n" +
                "**************************************************************************\r\n" +
                "             欢迎20173442使用中国工商银行自助柜员系统                                \r\n" +
                "**************************************************************************\r\n" +
                "1.存款\r\n" +
                "2.取款\r\n" +
                "3.转账汇款\r\n" +
                "4.修改密码\r\n" +
                "5.查询余额\r\n" +
                "6.退出\r\n" +
                "请输入要实现的功能 ：\r\n"+
                "**************************************************************************\r\n" +
                "             再见20173442感谢使用中国工商银行自助柜员系统                                \r\n" +
                "**************************************************************************\r\n",outContent.toString());
    }

    @Test
    public void test02() {
        String data = "111\n20173402\n" +
                "20173442\n" +
                "12345\n"+
                "123456\n"+
                "6";
        ByteArrayOutputStream outContent = new ByteArrayOutputStream();
        ByteArrayInputStream input = new ByteArrayInputStream(data.getBytes());
        System.setOut(new PrintStream(outContent));
        System.setIn(input);
        String[] a= {"1"};
        new Atm().main(a);
        assertEquals("**************************************************************************\r\n" +
                "                  欢迎使用中国工商银行自动柜员系统                                               \r\n" +
                "**************************************************************************\r\n" +
                "                      请输入您的账号\r\n" +
                "不是工行号,请重新输入\r\n" +
                "请输入您的账号\r\n" +
                "该账号不存在,请重新输入\r\n" +
                "请输入您的账号\r\n" +
                "**************************************************************************\r\n" +
                "             欢迎20173442使用中国工商银行自助柜员系统                                \r\n" +
                "**************************************************************************\r\n" +
                "                           请输入密码\r\n" +
                "                         请重新输入密码\r\n" +
                "密码正确\r\n" +
                "**************************************************************************\r\n" +
                "             欢迎20173442使用中国工商银行自助柜员系统                                \r\n" +
                "**************************************************************************\r\n" +
                "1.存款\r\n" +
                "2.取款\r\n" +
                "3.转账汇款\r\n" +
                "4.修改密码\r\n" +
                "5.查询余额\r\n" +
                "6.退出\r\n" +
                "请输入要实现的功能 ：\r\n"+
                "**************************************************************************\r\n" +
                "             再见20173442感谢使用中国工商银行自助柜员系统                                \r\n" +
                "**************************************************************************\r\n",outContent.toString());
    }

    @Test
    public void test03() {
        String data = "111\n20173402\n" +
                "20173442\n" +
                "12345\n"+
                "12345\n"+
                "12345\n"+
                "12345";
        ByteArrayOutputStream outContent = new ByteArrayOutputStream();
        ByteArrayInputStream input = new ByteArrayInputStream(data.getBytes());
        System.setOut(new PrintStream(outContent));
        System.setIn(input);
        String[] a= {"1"};
        new Atm().main(a);
        assertEquals("**************************************************************************\r\n" +
                "                  欢迎使用中国工商银行自动柜员系统                                               \r\n" +
                "**************************************************************************\r\n" +
                "                      请输入您的账号\r\n" +
                "不是工行号,请重新输入\r\n" +
                "请输入您的账号\r\n" +
                "该账号不存在,请重新输入\r\n" +
                "请输入您的账号\r\n" +
                "**************************************************************************\r\n" +
                "             欢迎20173442使用中国工商银行自助柜员系统                                \r\n" +
                "**************************************************************************\r\n" +
                "                           请输入密码\r\n" +
                "                         请重新输入密码\r\n" +
                        "                         请重新输入密码\r\n" +
                        "                         请重新输入密码\r\n" +
                        "                      密码次数达到上限\r\n"
                ,outContent.toString());
    }

    @Test
    public void test04() {
        String data = "20173442\n" +
                "123456\n"+
                "6";
        ByteArrayOutputStream outContent = new ByteArrayOutputStream();
        ByteArrayInputStream input = new ByteArrayInputStream(data.getBytes());
        System.setOut(new PrintStream(outContent));
        System.setIn(input);
        String[] a= {"1"};
        new Atm().main(a);
        assertEquals("**************************************************************************\r\n" +
                "                  欢迎使用中国工商银行自动柜员系统                                               \r\n" +
                "**************************************************************************\r\n" +
                "                      请输入您的账号\r\n" +
                "**************************************************************************\r\n" +
                "             欢迎20173442使用中国工商银行自助柜员系统                                \r\n" +
                "**************************************************************************\r\n" +
                "                           请输入密码\r\n" +
                "密码正确\r\n" +
                "**************************************************************************\r\n" +
                "             欢迎20173442使用中国工商银行自助柜员系统                                \r\n" +
                "**************************************************************************\r\n" +
                "1.存款\r\n" +
                "2.取款\r\n" +
                "3.转账汇款\r\n" +
                "4.修改密码\r\n" +
                "5.查询余额\r\n" +
                "6.退出\r\n" +
                "请输入要实现的功能 ：\r\n"+
                "**************************************************************************\r\n" +
                "             再见20173442感谢使用中国工商银行自助柜员系统                                \r\n" +
                "**************************************************************************\r\n",outContent.toString());
    }

    @Test
    public void test05() {
        String data = "20173442\n" +
                "123456\n"+
                "1\n"+
                "100\n"+
                "6";
        ByteArrayOutputStream outContent = new ByteArrayOutputStream();
        ByteArrayInputStream input = new ByteArrayInputStream(data.getBytes());
        System.setOut(new PrintStream(outContent));
        System.setIn(input);
        String[] a= {"1"};
        new Atm().main(a);
        assertEquals("**************************************************************************\r\n" +
                "                  欢迎使用中国工商银行自动柜员系统                                               \r\n" +
                "**************************************************************************\r\n" +
                "                      请输入您的账号\r\n" +
                "**************************************************************************\r\n" +
                "             欢迎20173442使用中国工商银行自助柜员系统                                \r\n" +
                "**************************************************************************\r\n" +
                "                           请输入密码\r\n" +
                "密码正确\r\n" +
                "**************************************************************************\r\n" +
                "             欢迎20173442使用中国工商银行自助柜员系统                                \r\n" +
                "**************************************************************************\r\n" +
                "1.存款\r\n" +
                "2.取款\r\n" +
                "3.转账汇款\r\n" +
                "4.修改密码\r\n" +
                "5.查询余额\r\n" +
                "6.退出\r\n" +
                "请输入要实现的功能 ：\r\n"+
                "请输入存款金额 : \r\n"+
                "存取款操作完成\r\n" +
                "存款余额为 ：100\r\n" +
                "**************************************************************************\r\n" +
                "             欢迎20173442使用中国工商银行自助柜员系统                                \r\n" +
                "**************************************************************************\r\n" +
                "1.存款\r\n" +
                "2.取款\r\n" +
                "3.转账汇款\r\n" +
                "4.修改密码\r\n" +
                "5.查询余额\r\n" +
                "请输入要实现的功能 ：\r\n"+
                "**************************************************************************\r\n" +
                "             再见20173442感谢使用中国工商银行自助柜员系统                                \r\n" +
                "**************************************************************************\r\n",outContent.toString());
    }


    @Test(expected= Exception.class)
    public void test06() {
        String data = "20173442\n" +
                "123456\n"+
                "2\n"+
                "1\n"+
                "6";
        ByteArrayOutputStream outContent = new ByteArrayOutputStream();
        ByteArrayInputStream input = new ByteArrayInputStream(data.getBytes());
        System.setOut(new PrintStream(outContent));
        System.setIn(input);
        String[] a= {"1"};
        new Atm().main(a);
    }

    @Test(expected= Exception.class)
    public void test07() {
        String data = "20173442\n" +
                "123456\n"+
                "2\n"+
                "2\n"+
                "6";
        ByteArrayOutputStream outContent = new ByteArrayOutputStream();
        ByteArrayInputStream input = new ByteArrayInputStream(data.getBytes());
        System.setOut(new PrintStream(outContent));
        System.setIn(input);
        String[] a= {"1"};
        new Atm().main(a);
    }

    @Test(expected= Exception.class)
    public void test08() {
        String data = "20173442\n" +
                "123456\n"+
                "2\n"+
                "3\n"+
                "6";
        ByteArrayOutputStream outContent = new ByteArrayOutputStream();
        ByteArrayInputStream input = new ByteArrayInputStream(data.getBytes());
        System.setOut(new PrintStream(outContent));
        System.setIn(input);
        String[] a= {"1"};
        new Atm().main(a);
    }

    @Test(expected= Exception.class)
    public void test09() {
        String data = "20173442\n" +
                "123456\n"+
                "2\n"+
                "4\n"+
                "6";
        ByteArrayOutputStream outContent = new ByteArrayOutputStream();
        ByteArrayInputStream input = new ByteArrayInputStream(data.getBytes());
        System.setOut(new PrintStream(outContent));
        System.setIn(input);
        String[] a= {"1"};
        new Atm().main(a);
    }

    @Test(expected= Exception.class)
    public void test10() {
        String data = "20173442\n" +
                "123456\n"+
                "2\n"+
                "5\n"+
                "6";
        ByteArrayOutputStream outContent = new ByteArrayOutputStream();
        ByteArrayInputStream input = new ByteArrayInputStream(data.getBytes());
        System.setOut(new PrintStream(outContent));
        System.setIn(input);
        String[] a= {"1"};
        new Atm().main(a);
    }

    @Test(expected= Exception.class)
    public void test11() {
        String data = "20173442\n" +
                "123456\n"+
                "2\n"+
                "6\n"+
                "6";
        ByteArrayOutputStream outContent = new ByteArrayOutputStream();
        ByteArrayInputStream input = new ByteArrayInputStream(data.getBytes());
        System.setOut(new PrintStream(outContent));
        System.setIn(input);
        String[] a= {"1"};
        new Atm().main(a);
    }

    @Test
    public void test12() {
        String data = "20173442\n" +
                "123456\n"+
                "2\n"+
                "7\n"+
                "0\n"+
                "6";
        ByteArrayOutputStream outContent = new ByteArrayOutputStream();
        ByteArrayInputStream input = new ByteArrayInputStream(data.getBytes());
        System.setOut(new PrintStream(outContent));
        System.setIn(input);
        String[] a= {"1"};
        new Atm().main(a);
        assertEquals("**************************************************************************\r\n" +
                "                  欢迎使用中国工商银行自动柜员系统                                               \r\n" +
                "**************************************************************************\r\n" +
                "                      请输入您的账号\r\n" +
                "**************************************************************************\r\n" +
                "             欢迎20173442使用中国工商银行自助柜员系统                                \r\n" +
                "**************************************************************************\r\n" +
                "                           请输入密码\r\n" +
                "密码正确\r\n" +
                "**************************************************************************\r\n" +
                "             欢迎20173442使用中国工商银行自助柜员系统                                \r\n" +
                "**************************************************************************\r\n" +
                "1.存款\r\n" +
                "2.取款\r\n" +
                "3.转账汇款\r\n" +
                "4.修改密码\r\n" +
                "5.查询余额\r\n" +
                "6.退出\r\n" +
                "请输入要实现的功能 ：\r\n"+
                "当前账户每日可支取2万\r\n" +
                        "1.100\r\n" +
                        "2.500\r\n" +
                        "3.1000\r\n" +
                        "4.1500\r\n" +
                        "5.2000\r\n" +
                        "6.5000\r\n" +
                        "7.其他金额\r\n" +
                        "输入金额 :\r\n" +
                        "取取款操作完成\r\n" +
                        "存款余额为 ：0\r\n"+
                "**************************************************************************\r\n" +
                "             欢迎20173442使用中国工商银行自助柜员系统                                \r\n" +
                "**************************************************************************\r\n" +
                "1.存款\r\n" +
                "2.取款\r\n" +
                "3.转账汇款\r\n" +
                "4.修改密码\r\n" +
                "5.查询余额\r\n" +
                "请输入要实现的功能 ：\r\n"+
                "**************************************************************************\r\n" +
                "             再见20173442感谢使用中国工商银行自助柜员系统                                \r\n" +
                "**************************************************************************\r\n",outContent.toString());
    }

    @Test
    public void test13() {
        String data = "20173442\n" +
                "123456\n"+
                "3\n"+
                "00000001\n"+
                "100\n"+
                "6";
        ByteArrayOutputStream outContent = new ByteArrayOutputStream();
        ByteArrayInputStream input = new ByteArrayInputStream(data.getBytes());
        System.setOut(new PrintStream(outContent));
        System.setIn(input);
        String[] a= {"1"};
        new Atm().main(a);
        assertEquals("**************************************************************************\r\n" +
                        "                  欢迎使用中国工商银行自动柜员系统                                               \r\n" +
                        "**************************************************************************\r\n" +
                        "                      请输入您的账号\r\n" +
                        "**************************************************************************\r\n" +
                        "             欢迎20173442使用中国工商银行自助柜员系统                                \r\n" +
                        "**************************************************************************\r\n" +
                        "                           请输入密码\r\n" +
                        "密码正确\r\n" +
                        "**************************************************************************\r\n" +
                        "             欢迎20173442使用中国工商银行自助柜员系统                                \r\n" +
                        "**************************************************************************\r\n" +
                        "1.存款\r\n" +
                        "2.取款\r\n" +
                        "3.转账汇款\r\n" +
                        "4.修改密码\r\n" +
                        "5.查询余额\r\n" +
                        "6.退出\r\n" +
                        "请输入要实现的功能 ：\r\n"+
                        "请输入转账账户 :\r\n" +
                        "请输入转账金额 :\r\n"+
                "当前账户余额为：-100\r\n"+
                        "**************************************************************************\r\n" +
                        "             欢迎20173442使用中国工商银行自助柜员系统                                \r\n" +
                        "**************************************************************************\r\n" +
                        "1.存款\r\n" +
                        "2.取款\r\n" +
                        "3.转账汇款\r\n" +
                        "4.修改密码\r\n" +
                        "5.查询余额\r\n" +
                        "请输入要实现的功能 ：\r\n"+
                        "**************************************************************************\r\n" +
                        "             再见20173442感谢使用中国工商银行自助柜员系统                                \r\n" +
                        "**************************************************************************\r\n"
                ,outContent.toString());
    }

    @Test
    public void test14() {
        String data = "20173442\n" +
                "123456\n"+
                "4\n"+
                "1234\n"+
                "6";
        ByteArrayOutputStream outContent = new ByteArrayOutputStream();
        ByteArrayInputStream input = new ByteArrayInputStream(data.getBytes());
        System.setOut(new PrintStream(outContent));
        System.setIn(input);
        String[] a= {"1"};
        new Atm().main(a);
        assertEquals("**************************************************************************\r\n" +
                        "                  欢迎使用中国工商银行自动柜员系统                                               \r\n" +
                        "**************************************************************************\r\n" +
                        "                      请输入您的账号\r\n" +
                        "**************************************************************************\r\n" +
                        "             欢迎20173442使用中国工商银行自助柜员系统                                \r\n" +
                        "**************************************************************************\r\n" +
                        "                           请输入密码\r\n" +
                        "密码正确\r\n" +
                        "**************************************************************************\r\n" +
                        "             欢迎20173442使用中国工商银行自助柜员系统                                \r\n" +
                        "**************************************************************************\r\n" +
                        "1.存款\r\n" +
                        "2.取款\r\n" +
                        "3.转账汇款\r\n" +
                        "4.修改密码\r\n" +
                        "5.查询余额\r\n" +
                        "6.退出\r\n" +
                        "请输入要实现的功能 ：\r\n"+
                "请输入修改后的密码\r\n" +
                        "修改成功，当前密码为\r\n" +
                        "当前账户余额为：0\r\n" +
                        "**************************************************************************\r\n" +
                        "             欢迎20173442使用中国工商银行自助柜员系统                                \r\n" +
                        "**************************************************************************\r\n" +
                        "1.存款\r\n" +
                        "2.取款\r\n" +
                        "3.转账汇款\r\n" +
                        "4.修改密码\r\n" +
                        "5.查询余额\r\n" +
                        "请输入要实现的功能 ：\r\n"+
                        "**************************************************************************\r\n" +
                        "             欢迎20173442使用中国工商银行自助柜员系统                                \r\n" +
                        "**************************************************************************\r\n" +
                        "1.存款\r\n" +
                        "2.取款\r\n" +
                        "3.转账汇款\r\n" +
                        "4.修改密码\r\n" +
                        "5.查询余额\r\n" +
                        "请输入要实现的功能 ：\r\n"+
                        "**************************************************************************\r\n" +
                        "             再见20173442感谢使用中国工商银行自助柜员系统                                \r\n" +
                        "**************************************************************************\r\n"
                ,outContent.toString());
    }

    @Test
    public void test15() {
        String data = "20173442\n" +
                "123456\n"+
                "5\n"+
                "6";
        ByteArrayOutputStream outContent = new ByteArrayOutputStream();
        ByteArrayInputStream input = new ByteArrayInputStream(data.getBytes());
        System.setOut(new PrintStream(outContent));
        System.setIn(input);
        String[] a= {"1"};
        new Atm().main(a);
        assertEquals("**************************************************************************\r\n" +
                        "                  欢迎使用中国工商银行自动柜员系统                                               \r\n" +
                        "**************************************************************************\r\n" +
                        "                      请输入您的账号\r\n" +
                        "**************************************************************************\r\n" +
                        "             欢迎20173442使用中国工商银行自助柜员系统                                \r\n" +
                        "**************************************************************************\r\n" +
                        "                           请输入密码\r\n" +
                        "密码正确\r\n" +
                        "**************************************************************************\r\n" +
                        "             欢迎20173442使用中国工商银行自助柜员系统                                \r\n" +
                        "**************************************************************************\r\n" +
                        "1.存款\r\n" +
                        "2.取款\r\n" +
                        "3.转账汇款\r\n" +
                        "4.修改密码\r\n" +
                        "5.查询余额\r\n" +
                        "6.退出\r\n" +
                        "请输入要实现的功能 ：\r\n"+
                        "当前账户余额为：0\r\n" +
                        "**************************************************************************\r\n" +
                        "             欢迎20173442使用中国工商银行自助柜员系统                                \r\n" +
                        "**************************************************************************\r\n" +
                        "1.存款\r\n" +
                        "2.取款\r\n" +
                        "3.转账汇款\r\n" +
                        "4.修改密码\r\n" +
                        "5.查询余额\r\n" +
                        "请输入要实现的功能 ：\r\n"+
                        "**************************************************************************\r\n" +
                        "             再见20173442感谢使用中国工商银行自助柜员系统                                \r\n" +
                        "**************************************************************************\r\n"
                ,outContent.toString());
    }

    @Test
    public void test16() {
        String data = "20173442\n" +
                "123456\n"+
                "3\n"+
                "1\n"+
                "6";
        ByteArrayOutputStream outContent = new ByteArrayOutputStream();
        ByteArrayInputStream input = new ByteArrayInputStream(data.getBytes());
        System.setOut(new PrintStream(outContent));
        System.setIn(input);
        String[] a= {"1"};
        new Atm().main(a);
        assertEquals("**************************************************************************\r\n" +
                        "                  欢迎使用中国工商银行自动柜员系统                                               \r\n" +
                        "**************************************************************************\r\n" +
                        "                      请输入您的账号\r\n" +
                        "**************************************************************************\r\n" +
                        "             欢迎20173442使用中国工商银行自助柜员系统                                \r\n" +
                        "**************************************************************************\r\n" +
                        "                           请输入密码\r\n" +
                        "密码正确\r\n" +
                        "**************************************************************************\r\n" +
                        "             欢迎20173442使用中国工商银行自助柜员系统                                \r\n" +
                        "**************************************************************************\r\n" +
                        "1.存款\r\n" +
                        "2.取款\r\n" +
                        "3.转账汇款\r\n" +
                        "4.修改密码\r\n" +
                        "5.查询余额\r\n" +
                        "6.退出\r\n" +
                        "请输入要实现的功能 ：\r\n"+
                        "请输入转账账户 :\r\n" +
                        "账户输入错误\r\n"+
                        "**************************************************************************\r\n" +
                        "             欢迎20173442使用中国工商银行自助柜员系统                                \r\n" +
                        "**************************************************************************\r\n" +
                        "1.存款\r\n" +
                        "2.取款\r\n" +
                        "3.转账汇款\r\n" +
                        "4.修改密码\r\n" +
                        "5.查询余额\r\n" +
                        "请输入要实现的功能 ：\r\n"+
                        "**************************************************************************\r\n" +
                        "             再见20173442感谢使用中国工商银行自助柜员系统                                \r\n" +
                        "**************************************************************************\r\n"
                ,outContent.toString());
    }

}